// let field0 = "    A   B   C   D   E   F   G   H   I   J\n" +
//     "   +---------------------------------------+\n";
// let field1 = " 1 |   |   |   |   |   |   |   |   |   |   |\n" +
//     "   |---|---|---|---|---|---|---|---|---|---|\n";
// let field2 = " 2 |   |   |   |   |   |   |   |   |   |   |\n" +
//     "   |---|---|---|---|---|---|---|---|---|---|\n";
// let field3 = " 3 |   |   |   |   |   |   |   |   |   |   |\n" +
//     "   |---|---|---|---|---|---|---|---|---|---|\n";
// let field4 = " 4 |   |   |   |   |   |   |   |   |   |   |\n" +
//     "   |---|---|---|---|---|---|---|---|---|---|\n";
// let field5 = " 5 |   |   |   |   |   |   |   |   |   |   |\n" +
//     "   |---|---|---|---|---|---|---|---|---|---|\n";
// let field6 = " 6 |   |   |   |   |   |   |   |   |   |   |\n" +
//     "   |---|---|---|---|---|---|---|---|---|---|\n";
// let field7 = " 7 |   |   |   |   |   |   |   |   |   |   |\n" +
//     "   |---|---|---|---|---|---|---|---|---|---|\n";
// let field8 = " 8 |   |   |   |   |   |   |   |   |   |   |\n" +
//     "   |---|---|---|---|---|---|---|---|---|---|\n";
// let field9 = " 9 |   |   |   |   |   |   |   |   |   |   |\n" +
//     "   |---|---|---|---|---|---|---|---|---|---|\n";
// let field10 = "10 |   |   |   |   |   |   |   |   |   |   |\n" +
//     "   +---------------------------------------+";
//
//
// let myfield1 = field1
//     .split('|')
//     .splice(0,10);
// myfield1[5]= " * "
// let yourfield1= myfield1.join('|');
//
//
// console.log(yourfield1);
// return field0 + field1 + field2 + field3 + field4 + field5 + field6 + field7 + field7 + field8 + field9+
//     field10;
// const readline = require("readline");
// const rl = readline.createInterface({
//     input: process.stdin,
//     output: process.stdout
// });
// rl.question('What is your favorite food? ', (answer) => {
//     console.log(`Oh, so your favorite food is ${answer}`);
//     rl.question('Введите координаты первого корабля ', (answer) => {
//
//                 rl.close();
//
//     });
// });
//
/*
псевдокод игры

1. Ползователю выводиться соообщение выбрать тип ввода координат
    if  ответ === ручной  то
        выводим сообщение ввести координаты
        проверка на валидность
        выводим сообщение ввести координаты
        ......

        записываем координаты в объект корабля


    иначе авто ввод
        случайный выбор координат и направление корабля
        проверка чтобы не пересекался с другими кораблями и в границах поля
        записываем координаты в объект корабля

повторяем для всех кораблей

2.    корабли кооторые пользователя отрисовываются ниже поля
        {_____}  {____}  {___}  {__}  {_}
        {ХХХХХ}  {ХХХХ}  {ХХХ}  {ХХ}  {Х}


3.    Автогенерация случайных кораблей компьютера

4.   начало игры

        ввод координат
        проверка на валидность
        проверка на попадание
        Пропущенные выстрелы изображаются на доске в виде /, а попадания в виде X.

        проверка на полностью убитый корабль
        проверка на все убиты корабли или нет

5 .Нужно уведомить противника, когда корабль полностью затонет.

6  окончание игры


---------------------------------------

Флот Кораблей
Ship	        Size	Quantity
Carrier         	5	1
Battleship      	4	1
Cruiser         	3	1
Destroyer	        2	2
Submarine	        1	2






*/
